GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_UDMACH7BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_DMABREQ          DMA burst request event from AUX, configured by
// AUX_EVCTL:DMACTL
//
#define EVENT_UDMACH7BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH7BSEL_EV_S                                      0
#define EVENT_UDMACH7BSEL_EV_AUX_DMABREQ                            0x00000076

//*****************************************************************************
//
// Register: EVENT_O_UDMACH8SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SW_DMABREQ       AUX observation loopback
//
#define EVENT_UDMACH8SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH8SSEL_EV_S                                      0
#define EVENT_UDMACH8SSEL_EV_AUX_SW_DMABREQ                         0x00000074

//*****************************************************************************
//
// Register: EVENT_O_UDMACH8BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SW_DMABREQ       AUX observation loopback
//
#define EVENT_UDMACH8BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH8BSEL_EV_S                                      0
#define EVENT_UDMACH8BSEL_EV_AUX_SW_DMABREQ                         0x00000074

//*****************************************************************************
//
// Register: EVENT_O_UDMACH9SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH9SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH9SSEL_EV_S                                      0
#define EVENT_UDMACH9SSEL_EV_NONE                                   0x00000045
#define EVENT_UDMACH9SSEL_EV_GPT0A_DMABREQ                          0x0000004D
#define EVENT_UDMACH9SSEL_EV_GPT0B_DMABREQ                          0x0000004E
#define EVENT_UDMACH9SSEL_EV_GPT1A_DMABREQ                          0x0000004F
#define EVENT_UDMACH9SSEL_EV_GPT1B_DMABREQ                          0x00000050
#define EVENT_UDMACH9SSEL_EV_GPT2A_DMABREQ                          0x00000051
#define EVENT_UDMACH9SSEL_EV_GPT2B_DMABREQ                          0x00000052
#define EVENT_UDMACH9SSEL_EV_GPT3A_DMABREQ                          0x00000053
#define EVENT_UDMACH9SSEL_EV_GPT3B_DMABREQ                          0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH9BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH9BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH9BSEL_EV_S                                      0
#define EVENT_UDMACH9BSEL_EV_NONE                                   0x00000045
#define EVENT_UDMACH9BSEL_EV_GPT0A_DMABREQ                          0x0000004D
#define EVENT_UDMACH9BSEL_EV_GPT0B_DMABREQ                          0x0000004E
#define EVENT_UDMACH9BSEL_EV_GPT1A_DMABREQ                          0x0000004F
#define EVENT_UDMACH9BSEL_EV_GPT1B_DMABREQ                          0x00000050
#define EVENT_UDMACH9BSEL_EV_GPT2A_DMABREQ                          0x00000051
#define EVENT_UDMACH9BSEL_EV_GPT2B_DMABREQ                          0x00000052
#define EVENT_UDMACH9BSEL_EV_GPT3A_DMABREQ                          0x00000053
#define EVENT_UDMACH9BSEL_EV_GPT3B_DMABREQ                          0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH10SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH10SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH10SSEL_EV_S                                     0
#define EVENT_UDMACH10SSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH10SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH10SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH10SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH10SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH10SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH10SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH10SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH10SSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH10BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH10BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH10BSEL_EV_S                                     0
#define EVENT_UDMACH10BSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH10BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH10BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH10BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH10BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH10BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH10BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH10BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH10BSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH11SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH11SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH11SSEL_EV_S                                     0
#define EVENT_UDMACH11SSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH11SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH11SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH11SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH11SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH11SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH11SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH11SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH11SSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH11BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH11BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH11BSEL_EV_S                                     0
#define EVENT_UDMACH11BSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH11BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH11BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH11BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH11BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH11BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH11BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH11BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH11BSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH12SSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH12SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH12SSEL_EV_S                                     0
#define EVENT_UDMACH12SSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH12SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH12SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH12SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH12SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH12SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH12SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH12SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH12SSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH12BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read/write selection value
// ENUMs:
// NONE                 Always inactive
// GPT0A_DMABREQ        GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT0B_DMABREQ        GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT1A_DMABREQ        GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT1B_DMABREQ        GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT2A_DMABREQ        GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT2B_DMABREQ        GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT3A_DMABREQ        GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT3B_DMABREQ        GPT3B DMA trigger event. Configured by GPT3:DMAEV
//
#define EVENT_UDMACH12BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH12BSEL_EV_S                                     0
#define EVENT_UDMACH12BSEL_EV_NONE                                  0x00000045
#define EVENT_UDMACH12BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH12BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH12BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH12BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH12BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH12BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH12BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH12BSEL_EV_GPT3B_DMABREQ                         0x00000054

//*****************************************************************************
//
// Register: EVENT_O_UDMACH13BSEL
//
//*****************************************************************************
// Field: [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_PROG2            Event selected by AON_EVENT MCU event selector,
// AON_EVENT:EVTOMCUSEL.AON_PROG2_EV
//
#define EVENT_UDMACH13BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH13BSEL_EV_S                                     0
#define EVENT_UDMACH13BSEL_EV_AON_PROG2                             0x00000003

