GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_SWEV
//
//*****************************************************************************
// Field: [24]    SWEV3
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 3 event.
#define EVENT_SWEV_SWEV3                                            0x01000000
#define EVENT_SWEV_SWEV3_BITN                                       24
#define EVENT_SWEV_SWEV3_M                                          0x01000000
#define EVENT_SWEV_SWEV3_S                                          24

// Field: [16]    SWEV2
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 2 event.
#define EVENT_SWEV_SWEV2                                            0x00010000
#define EVENT_SWEV_SWEV2_BITN                                       16
#define EVENT_SWEV_SWEV2_M                                          0x00010000
#define EVENT_SWEV_SWEV2_S                                          16

// Field: [8]    SWEV1
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 1 event.
#define EVENT_SWEV_SWEV1                                            0x00000100
#define EVENT_SWEV_SWEV1_BITN                                       8
#define EVENT_SWEV_SWEV1_M                                          0x00000100
#define EVENT_SWEV_SWEV1_S                                          8

// Field: [0]    SWEV0
//
// Writing &quot;1&quot; to this bit when the value is &quot;0&quot; triggers the
// Software 0 event.
#define EVENT_SWEV_SWEV0                                            0x00000001
#define EVENT_SWEV_SWEV0_BITN                                       0
#define EVENT_SWEV_SWEV0_M                                          0x00000001
#define EVENT_SWEV_SWEV0_S                                          0

#endif // __HW_EVENT_H__
